benchmark_results_replicated/20260803_085536/analysis/rep20/run/go_heavy_mock_c400/wrk_output.txt
Running 1m test @ http://localhost:8080/days-since-heavy-mock
  4 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   115.58ms  133.26ms   1.39s    85.09%
    Req/Sec     1.29k   178.40     2.03k    68.67%
  Latency Distribution
     50%   64.41ms
     75%  184.96ms
     90%  290.24ms
     99%  573.96ms
  307852 requests in 1.00m, 42.52MB read
Requests/sec:   5125.68
Transfer/sec:    724.91KB
P95: 365054
P99: 573955